using UnityEngine;

public enum Genre
{
    Триллер = 1,
    Боевик = 2,
    Фантастика = 3,
    Фэнтези = 4,
    Приключения = 5,
    Музыка = 6,
    Мультфильм = 7,
    Драма = 8,
    Ужасы = 9,
    Комедии = 10,
    Историческое = 11,
    Детектив = 12,
    Порно = 13,
    Хит = 14,
    Опера = 15,
    Возвращённые = 16,
}

public enum SubFantasy
{
    SpaceOpera,
    RobotsAndAI,
    Aliens

    // Космоопера · Роботы и ИИ · Пришельцы · Киберпанк · Постапокалипсис · Путешествия во времени · Антиутопии · Космический хоррор · Монстр-муви
}

public enum SubThrillerAndCrime
{
    Psychological,
    Detectives,
    Noir

    // Триллеры · Психологические триллеры · Детективы · Нуар · Неонуар · Криминал · Мафия · Ограбления · Тюремное кино · True crime
}


public enum SubDramas
{
    Family,
    Judicial,
    Social

    // Драмы · Семейные драмы · Судебные драмы · Социальные драмы · Биографии · Исторические драмы · Военные драмы · Спортивные драмы · Музыкальные драмы · Арт-драмы
}